'''
Работаем в командной строке (терминале ОС)
Создайте каталог для проекта first_project и разверните виртуальное окружение Python в папке venv внутри каталога
Создайте третий каталог проекта project_new и разверните виртуальное окружение Python в папке venv_new внутри каталога
Для каждого проекта последовательно активируйте и деактивируйте виртуальное окружение
'''
'''
Активируем виртуальное окружение первого из трёх созданных проектов и устанавливаем в него модуль requests используя pip
Проверяем установку выводом списка модулей в консоль
Сохраняем список в файл, проверяем результат и выходим из окружения
Активируем виртуальное окружение второго из трёх созданных проектов и устанавливаем в него модуль flask используя pip
Проверяем установку выводом списка модулей в консоль
Сохраняем список в файл и выходим из окружения
Активируем третье виртуальное окружение
Устанавливаем в него модули из первого и второго проекта используя ранее сохранённые в файлы списки модулей
Проверяем установку выводом списка модулей в консоль
'''


